{
  "banner_content": "Ваш вибір №1 для великих обсягів — економічно, якісно, вчасно",
  "banner_title": "Надійний алюміній для бізнесу",
  "nav": {
    "home": "Головна",
    "production": "Виробництво",
    "products": "Продукція",
    "quality": "Якість",
    "contacts": "Контакти",
    "language": "Мова",
    "address": "3-й Травневий провулок, Кам’янське, Дніпропетровська область"
  },
  "about": {
    "heroTitle": "Комплексні рішення у сфері постачання алюмінію під ключ",
    "heroDescription": "ТОВ «Алефмет» — це сучасне підприємство, що cпеціалізується на виробництві вторинних алюмінієвих сплавів для промислового використання. Ми пропонуємо повний цикл послуг, від виробництва алюмінієвих сплавів до їхньої доставки на ваш об’єкт. Наша мета — забезпечити вам надійність, точність і економію часу на кожному етапі.",
    "listName": "Чому обирають нас?",

    "listTitle_1": "Досвід та Експертиза",
    "listDescr_1": "Багаторічний досвід у галузі металургії та команда висококваліфікованих фахівців дозволяють нам знаходити оптимальні рішення для найскладніших завдань.",

    "listTitle_2": "Надійність постачання",
    "listDescr_2": "Ми гарантуємо стабільність постачання та виконання зобов`язань, завдяки потужностям, що дозволяють виробляти понад 500 тонн алюмінію щомісяця.",

    "listTitle_3": "Індивідуальний підхід",
    "listDescr_3": "Ми надаємо гнучкі рішення, що повністю відповідають вашим унікальним вимогам. Ваші індивідуальні креслення та специфікації — наш пріоритет.",

    "listTitle_4": "Відповідність стандартам",
    "listDescr_4": "Наша продукція відповідає міжнародним стандартам якості EN, ISO, ASTM, що є гарантією надійного хімічного складу та своєчасної доставки.",
    "listName_2": "Наші продукти та послуги",

    "btnProduct": "Продукція",
    "btnContact": "Контакти",

    "title": "Наш метал працює по всьому світу",
    "export": "Експорт до країн Азії та Європи"
  },
  "production": {
    "title": "Наше виробництво",
    "descr": "Сучасні технології, автоматизація процесів і контроль якості на кожному етапі.",
    "videoContent_1": "Наше виробництво – це поєднання найсучасніших технологій та багаторічного досвіду у сфері металургії. Ми контролюємо кожен крок, від підготовки сировини до відливки готової продукції.",
    "videoContent_2": "Ми не просто створюємо метал – ми забезпечуємо вам надійність, точність та економію часу.",
    "listTitle_1": "Етапи виробництва",
    "listDescr_1": "Від іскри до досконалості: кожен етап виробництва алюмінієвих чушок — це мистецтво трансформації металу. Ми поєднуємо традиції майстерності з інноваційними технологіями, щоб гарантувати бездоганну якість та надійність для вашого бізнесу.",

    "listTitle_2": "Точність у кожному сплаві: Наша лабораторія",
    "listDescr_2": "Серце нашого контролю якості – портативний спектрометр. Це не просто прилад, а ключ до безкомпромісної чистоти. Кожен зразок алюмінію проходить експрес-аналіз, що миттєво підтверджує його хімічний склад.",
    "listDescr_2_2": "Ця технологія дозволяє нам відстежувати домішки та легуючі  елементи з високою точністю, забезпечуючи, що кожен сплав відповідає найсуворішим вимогам EN, ISO, ASTM.",

    "listTitle_3": "Доставка та логістика",
    "listDescr_3": "Готова продукція: Завантаження та відправка. Наші потужності дозволяють виробляти понад 500 тонн алюмінію щомісяця, що забезпечує стабільність та надійність постачання. Ми доставляємо метал у будь-яку точку світу, підтверджуючи наш статус глобального партнера.",

    "listTitle_4": "Потрібен надійний партнер в бізнесі?",
    "listDescr_4": "Ми поєднуємо досвід, технології та індивідуальний підхід, щоб ваш бізнес був успішним.",

    "btnProduct": "Продукція",
    "btnContact": "Контакти"
  },
  "contact": {
    "title": "Зв`язатися з нами",
    "tel": "Зателефонуйте нам",
    "email": "Напишіть нам",
    "address_title": "Адреса",
    "address": "3-й Травневий провулок, Кам’янське, Дніпропетровська область",
    "sendMessage": "Залишити повідомлення",
    "titleMessage": "Хочете дізнатися більше або зробити замовлення? Залиште повідомлення — ми з вами зв’яжемось.",
    "emailAddress": "Ваша електронна адреса",
    "telMessage": "Тел. /Whatsapp",
    "message": "Ваше повідомлення",
    "send": "Надіслати"
  }
}
